ClassExercises/WEEK6/DAY1/taskly/app/controllers/api/v1/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Peper"], ["email", "pe@pe.com"], ["created_at", "2016-03-07 09:38:06.934245"], ["updated_at", "2016-03-07 09:38:06.934245"]]