Day Exercises/WEEK6/video-games/app/controllers/api/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    tours=Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "arena 1"], ["created_at", "2016-03-07 17:16:40.460177"], ["updated_at", "2016-03-07 17:16:40.460177"]]
---
  def create
    tour = Tournament.create(tournament_params)

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 7]]
---
  def delete
    tour = Tournament.find(params[:id])
    tour.destroy